# CanUsePlusPrefix Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..CanUsePlusPrefix Method
FormatOptions Class See Also
---
Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanUsePlusPrefix()
```

Visual Basic
---
```text
Public Function CanUsePlusPrefix As Boolean
```

Visual C++
---
```text
public:
bool CanUsePlusPrefix()
```

# ### Return Value
True if a plus prefix can be displayed, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
CanUsePlusPrefix Overload
Autodesk.Revit.DB Namespace